{"class_name": "Sequential", "keras_version": "1.1.0", "config": [{"class_name": "Convolution2D", "config": {"subsample": [1, 1], "batch_input_shape": [null, 32, 32, 1], "trainable": true, "dim_ordering": "tf", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "border_mode": "valid", "input_dtype": "float32", "nb_filter": 16, "W_constraint": null, "activation": "linear", "bias": true, "nb_col": 3, "name": "convolution2d_1", "init": "glorot_uniform", "W_regularizer": null, "nb_row": 3}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "tanh", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_1", "dim_ordering": "tf", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "subsample": [1, 1], "init": "glorot_uniform", "dim_ordering": "tf", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "border_mode": "valid", "nb_filter": 32, "activation": "linear", "bias": true, "nb_col": 3, "name": "convolution2d_2", "trainable": true, "W_regularizer": null, "W_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "tanh", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_2", "dim_ordering": "tf", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "subsample": [1, 1], "init": "glorot_uniform", "dim_ordering": "tf", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "border_mode": "valid", "nb_filter": 32, "activation": "linear", "bias": true, "nb_col": 3, "name": "convolution2d_3", "trainable": true, "W_regularizer": null, "W_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "tanh", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 128, "trainable": true, "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "activation": "linear", "bias": true, "name": "dense_1", "init": "glorot_normal", "W_constraint": null, "input_dim": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "tanh", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"output_dim": 7024, "trainable": true, "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "activation": "linear", "bias": true, "name": "dense_2", "init": "glorot_normal", "W_constraint": null, "input_dim": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "softmax", "trainable": true}}]}