{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"trainable": true, "init": "glorot_uniform", "border_mode": "valid", "name": "convolution2d_1", "b_constraint": null, "subsample": [1, 1], "W_constraint": null, "dim_ordering": "tf", "input_dtype": "float32", "b_regularizer": null, "activation": "linear", "W_regularizer": null, "nb_col": 3, "nb_row": 3, "batch_input_shape": [null, 28, 28, 1], "nb_filter": 32, "bias": true, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "init": "glorot_uniform", "border_mode": "valid", "name": "convolution2d_2", "b_constraint": null, "subsample": [1, 1], "W_constraint": null, "dim_ordering": "tf", "nb_filter": 32, "b_regularizer": null, "activation": "linear", "W_regularizer": null, "nb_col": 3, "nb_row": 3, "bias": true, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "strides": [2, 2], "pool_size": [2, 2], "name": "maxpooling2d_1", "dim_ordering": "tf"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "init": "glorot_uniform", "b_constraint": null, "bias": true, "W_constraint": null, "output_dim": 128, "input_dim": 4608, "b_regularizer": null, "activation": "linear", "W_regularizer": null, "name": "dense_1", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Dense", "config": {"trainable": true, "init": "glorot_uniform", "b_constraint": null, "bias": true, "W_constraint": null, "output_dim": 10, "input_dim": 128, "b_regularizer": null, "activation": "linear", "W_regularizer": null, "name": "dense_2", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "softmax"}}], "keras_version": "1.2.0"}