{"keras_version": "1.1.0", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"nb_row": 3, "b_constraint": null, "nb_filter": 16, "batch_input_shape": [null, 32, 32, 1], "border_mode": "valid", "bias": true, "trainable": true, "activation": "linear", "b_regularizer": null, "name": "convolution2d_1", "input_dtype": "float32", "subsample": [1, 1], "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null, "dim_ordering": "tf", "nb_col": 3}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "border_mode": "valid", "trainable": true, "pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_1"}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "b_constraint": null, "nb_filter": 32, "border_mode": "valid", "bias": true, "trainable": true, "activation": "linear", "b_regularizer": null, "name": "convolution2d_2", "nb_col": 3, "subsample": [1, 1], "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "border_mode": "valid", "trainable": true, "pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_2"}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "b_constraint": null, "nb_filter": 32, "border_mode": "valid", "bias": true, "trainable": true, "activation": "linear", "b_regularizer": null, "name": "convolution2d_3", "nb_col": 3, "subsample": [1, 1], "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_3"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_constraint": null, "activation": "linear", "bias": true, "trainable": true, "output_dim": 128, "b_regularizer": null, "name": "dense_1", "W_regularizer": null, "init": "he_normal", "W_constraint": null, "activity_regularizer": null, "input_dim": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_4"}}, {"class_name": "Dense", "config": {"b_constraint": null, "activation": "linear", "bias": true, "trainable": true, "output_dim": 10, "b_regularizer": null, "name": "dense_2", "W_regularizer": null, "init": "he_normal", "W_constraint": null, "activity_regularizer": null, "input_dim": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_5"}}]}