{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "trainable": true, "activity_regularizer": null, "W_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "batch_input_shape": [null, 32, 32, 1], "activation": "linear", "b_constraint": null, "bias": true, "input_dtype": "float32", "dim_ordering": "tf", "nb_col": 5, "b_regularizer": null, "nb_filter": 6, "nb_row": 5, "border_mode": "valid", "W_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid", "name": "maxpooling2d_1"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "activity_regularizer": null, "W_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_regularizer": null, "activation": "linear", "b_constraint": null, "bias": true, "b_regularizer": null, "dim_ordering": "tf", "nb_col": 5, "nb_filter": 16, "nb_row": 5, "border_mode": "valid", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid", "name": "maxpooling2d_2"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "activity_regularizer": null, "W_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_regularizer": null, "activation": "linear", "b_constraint": null, "bias": true, "b_regularizer": null, "dim_ordering": "tf", "nb_col": 5, "nb_filter": 120, "nb_row": 5, "border_mode": "valid", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "W_constraint": null, "init": "normal", "W_regularizer": null, "activation": "linear", "output_dim": 120, "b_constraint": null, "input_dim": null, "b_regularizer": null, "trainable": true, "bias": true, "name": "dense_1"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "W_constraint": null, "init": "normal", "W_regularizer": null, "activation": "linear", "output_dim": 11, "b_constraint": null, "input_dim": null, "b_regularizer": null, "trainable": true, "bias": true, "name": "dense_2"}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_5"}}], "keras_version": "1.1.0"}